perf/scenarios/metars.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      payload:
        path: "metars.csv"
        order: random
        skipHeader: true
        fields:
          - "Name"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 60
      arrivalRate: 5
    

scenarios:
  - name: Metars
    flow:
      - get:
          url: '/metar?station={{ Name }}'